[
  {
    "url": "https://www.happytap.com.au",
    "title": "Home | Happy Tap Plumbing",
    "content": "Happy Tap Plumbing is a local, friendly plumbing expert on the Gold Coast. They offer professional plumbing and roofing services with a guarantee of no plumbers crack.",
    "headings": []
  },
  {
    "url": "https://www.happytap.com.au/blank-3",
    "title": "Services | Happy Tap Plumbing",
    "content": "The page showcases a plumbing and repair business offering a variety of services including emergency plumbing repairs, appliance installation, roofing plumbing, guttering, leak detection, and blocked drain cleaning. The business provides contact information including address, phone number, email, and operating hours.",
    "headings": [
      "SERVICES",
      "Contact Us",
      "Address",
      "Contact",
      "Opening Hours"
    ]
  },
  {
    "url": "https://www.happytap.com.au/blank-2",
    "title": "FAQ | Happy Tap Plumbing",
    "content": "Happy Tap Plumbing is committed to being qualified experts for all your plumbing needs. This page provides a list of frequently asked questions and answers related to their services, including virtual consultations, hourly rates, and accepted payment methods.",
    "headings": [
      "FREQUENTLY ASKED QUESTIONS",
      "Q&A",
      "DO YOU OFFER VIRTUAL CONSULTATIONS?",
      "DO YOU CHARGE BY THE HOUR?",
      "WHICH PAYMENT METHODS DO YOU ACCEPT?"
    ]
  },
  {
    "url": "https://www.happytap.com.au/book-online",
    "title": "Book Online | Happy Tap Plumbing",
    "content": "The page indicates that there are currently no bookings available. It advises visitors to check back later.",
    "headings": []
  },
  {
    "url": "https://www.happytap.com.au/blank-4",
    "title": "Contact | Happy Tap Plumbing",
    "content": "This page is a contact page for Happy Tap plumbing services. It provides a phone number and email address to contact Jack at Happy Tap for plumbing services in Gold Coast, QLD, Australia.",
    "headings": [
      "CONTACT JACK AT HAPPY TAP TODAY"
    ]
  },
  {
    "url": "https://www.happytap.com.au/",
    "title": "Home | Happy Tap Plumbing",
    "content": "Happy Tap Plumbing is a local, friendly plumbing expert on the Gold Coast. They offer professional plumbing and roofing services with over 10 years of experience. They provide emergency maintenance available 24/7.",
    "headings": []
  }
]